Repository: fsiebi1/Vogt-Siebenfoercher-Pumpfer
Catalog: CodingLanguages/Resources/Controllers/HomeController.*.resx
Languages: de_de

source: About Us
de_de: Über uns

# adv
source: Advantages
de_de: Vorteile

# dia
source: Disadvantages
de_de: Nachteile

# index.h1
source: Coding Languages
de_de: Programmiersprachen

# index.java.adv
source: platform independent, strong community support
de_de: plattormunabhängig, starker Community-Support

# index.java.disadv
source: considerably less performant than other programming languages
de_de: erheblich unperformanter als andere Programmiersprachen

# index.lang
source: Language
de_de: Sprache

# index.net.adv
source: cross-platform, many libraries provided
de_de: plattformübergreifend, viele Bibliotheken bereitgestellt

# index.net.disadv
source: Gap between release and stability
de_de: Lücke zwischen Release und Stabilität

# index.object
source: Object-oriented
de_de: Objektorientiert

# index.py.adv
source: user-friendly, uncomplicated and fast
de_de: benutzerfreundlich, unkompliziert und schnell

# index.py.disadv
source: Design restrictions
de_de: Designeinschränkungen

# index.yes
source: Yes
de_de: Ja

# java.ad1
source: Due to pre-installed Java tools, the Java source code is first translated into byte code by the Java compiler and only then interpreted by the Java Virtual Machine (JVM) and executed as machine code.
de_de: Aufgrund von vorinstallierten Java-Tools, wird der Java-Quellcode vom Java-Compiler zuerst in einen Byte-Code übersetzt und erst dann von der Java Virtual Machine (JVM) interpretiert und als Maschinencode ausgeührt

# java.ad1h
source: Platform independence:
de_de: Plattformunabhängigkeit:

# java.ad2
source: However, this advantage is also a huge disadvantage at the same time, because this platform independence results in a significant loss of performance and speed
de_de: Jedoch ist dieser Vorteil auch zugleich ein riesiger Nachteil, denn durch diese Plattformunabhängigkeit entsteht ein erheblicher Performance- und Geschwindigkeitsverlust

# java.ad3
source: Java receives regular updates, which ensure up-to-dateness, stability and flexibility. In addition, Java has a gigantic selection of libraries and frameworks, some of which were created and made available by the large Java community.
de_de: Java erhält regelmäßig Updates, welche Aktualität, Stabilität und Flexibilität gewährleisten. Zusätzlich hat Java eine gigantische Auswahl an Bibliotheken und Frameworks, welche teilweise von der großen Community Javas erstellt und zur Verfügung gestellt wurden.

# java.ad3h
source: Strong community support:
de_de: Starker Community-Support:

# java.ad4
source: Since Java requires a very strict typical programming style, it can lead to the fact that the written code can become longer read with other programming languages and thereby also more memory is needed.
de_de: Da Java einen sehr strikten typischen Porgrammierstil fordert, kann es dazu führen, dass der geschriebene Code länger werden kann las bei anderen Programmiersprachen und dadurch auch mehr Speicherplatz benötigt wird.

# java.ad4h
source: Program code length:
de_de: Programmcodelänge:

# java.p1
source: Java is a special programming language, which is based on the syntax of the programming languages C and C++. During the development of Java, great care was taken from the beginning to ensure that certain serious programming errors could not occur in the first place.
de_de: Java ist eine besondere Programmiersprache, die sich an der Syntax der Programmiersprachen C und C++ anlehnt. Bei der Entwicklung von Java wurde von Beginn an genauestens darauf geachtet, dass bestimmte schwere Programmierfehler erst gar nicht auftreten können.

# java.p2
source: For example, there are no pointers in Java and thus the programmer cannot accidentally access the wrong memory address.
de_de: So gibt es in Java keine Pointer und somit kann der Programmierer nicht aus Versehen auf die falsche Speicheradresse zugreifen.

# java.p3
source: Among programmers, Java is highly appreciated as an easy-to-learn, object-oriented, secure and computer architecture-independent programming language. In recent years, Java developers have succeeded in making the programming language more and more powerful.
de_de: Unter den Programmierern wird Java als eine einfach zu erlernenden, objektorientierte, sichere und von der Rechnerarchitektur unabhängige Programmiersprache sehr geschätzt. In den letzten Jahren ist es den Entwicklern von Java gelungen die Programmiersprache immer leistungsfähiger zu machen.

# java.p4
source: Java is a very well thought-out and lightweight programming language that does without certain features of C++, such as pointers, multiple inheritance and header files, for good reason.
de_de: Java ist eine sehr durchdachte und leichtgewichtige Programmiersprache, die aus gutem Grund auf bestimmte Funktionen von C++ verzichtet, wie beispielsweise Pointer, Mehrfachvererbung und Header-Dateien.

# java.p5
source: Instead, many sophisticated features, such as exception handling, concurrency, and graphical user interface, have been integrated into the Java programming language.
de_de: Stattdessen wurden viele anspruchsvolle Funktionen, wie Ausnahmenbehandlung, Nebenläufigkeit und grafische Benutzeroberfläche, in die Programmiersprache Java integriert.

# java.p6
source: Java contains all the features of modern object-oriented programming languages.
de_de: In Java sind alle Eigenschaften moderner objektorientierter Programmiersprachen enthalten.

# net.ad1
source: .NET is based on an object-oriented programming language. Object oriented programming is one of the best things to use .NET Framework. In .NET Framework, the object is divided into smaller blocks. This makes it easier for developers to work on one block at a time. This enables them to perform tasks effectively.
de_de: .NET basiert auf einer objektorientierten Programmiersprache. Objektorientiertes Programmieren ist eines der besten Dinge zum Nutzen des .NET Frameworks. Im .NET Framework ist das Objekt in kleinere Blöcke unterteilt. Dies erleichtert Entwicklern die Arbeit an jeweils einem Block. Dadurch können sie Aufgaben effektiv ausführen.

# net.ad1h
source: Object-oriented software development model:
de_de: Objektorientiertes Softwareentwicklungsmodell:

# net.ad2
source: Updates are very frequent and are required for all products in the technology area. The problem occurs when updates do not show the previous version. When some changes are made to the database and design, the original version is not supported and works only in new versions.
de_de: Aktualisierungen sind sehr häufig und werden für alle Produkte des Technologiebereichs benötigt. Das Problem tritt auf, wenn bei Updates die vorherige Version nicht angezeigt wird. Wenn einige Änderungen an der Datenbank und am Design vorgenommen werden, wird die ursprüngliche Version nicht unterstützt und funktioniert nur in neuen Versionen.

# net.ad2h
source: Limited object-relational support:
de_de: Eingeschränkter objektrelationaler Support:

# net.ad3
source: .NET has excellent development tools. These extremely useful tools facilitate deployment and maintenance. It is easy to troubleshoot. It provides the flexibility to disassemble applications, fix the problem and assemble.
de_de: .NET verfügt über hervorragende Entwicklungswerkzeuge. Diese äußerst nützlichen Tools erleichtern die Bereitstellung und Wartung. Es ist einfach, den Fehler zu beheben. Es bietet die Flexibilität, Anwendungen zu zerlegen, das Problem zu beheben und zusammenzustellen.

# net.ad3h
source: Flexible deployment and easy maintenance:
de_de: Flexible Bereitstellung und einfache Wartung:

# net.ad4
source: The .NET Framework is not known for providing new support and updates. When updates are made, support is lacking here. Some users describe that therefore often in release documents are included, which worked in a beta version but have errors in the published nVersion.
de_de: Das .NET Framework ist nicht dafür bekannt, neuen Support und Updates bereitzustellen. Wenn Aktualisierungen vorgenommen werden, fehlt hier die Unterstützung. Einige Nutzer beschreiben, dass daher oftmals bei Release Dokumente enthalten sid, welche in einer Beta-Version funktionierten aber in der veröffentlichte nVersion Fehler aufweisen.

# net.ad4h
source: Gap between release and stability:
de_de: Lücke zwischen Release und Stabilität:

# net.p1
source: The .NET Framework is a software platform and runtime environment, with its own class libraries, interfaces and utilities, that supports different programming languages.
de_de: Beim .NET Framework handelt es sich um eine Software-Plattform und Laufzeit­umgebung, mit eigenen Klassenbibliotheken, Schnittstellen und Dienst­pro­grammen, die unterschiedliche Programmiersprachen unterstützt.

# net.p2
source: The runtime environment CLR (Common Language Runtime) is a module for the cross-language management of code.
de_de: Bei der Laufzeitumgebung CLR (Common Language Runtime) handelt es sich um ein Modul für die sprachübergreifende Verwaltung von Code.

# net.p3
source: Cross-language in this context means that the NET Framework was not designed for only one high-level language, but that programming languages such as C++, C#, J# or Visual Basic can be used for programming applications that are first translated into a common intermediate language CIL (Common Intermediate Language) before compiling.
de_de: Unter sprachübergreifend ist in diesem Zusammenhang zu verstehen, dass das NET Framework nicht nur für eine Hochsprache ausgelegt wurde, sondern das Programmiersprachen wie C++, C#, J# oder Visual Basic für die Programmierung von Anwendungen verwendet werden können, die vor dem Kompilieren zuerst in eine gemeinsame Zwischensprache CIL (Common Intermediate Language) übersetzt werden.

# net.p4
source: In the case of .NET programming of applications with the C++ programming language and the CLR runtime environment, there is also the fact that Microsoft extended the language scope of this programming language in a derived variant of C++, among other things to enable access to the .NET library.
de_de: Bei der .NET-Programmierung von Anwendungen mit der Programmiersprache C++ und der Laufzeitumgebung CLR kommt hinzu, dass Microsoft in einer abgeleiteten Variante von C++ den Sprachumfang dieser Programmiersprache erweiterte, unter anderen um den Zugriff auf .NET Bibliothek zu ermöglichen.

# py.ad1
source: Experts and beginners can easily understand the code and you can quickly become productive with this language, since it contains fewer dialects than other popular languages like Perl. Since its source code is similar to pseudocode, it is also easy to learn. Once you start learning, you can start coding practically immediately.
de_de: Experten und Anfänger können den Code leicht verstehen und Sie können mit dieser Sprache schnell produktiv werden, da sie weniger Dialekte als andere beliebte Sprachen wie Perl enthält. Da sein Quellcode dem Pseudocode ähnelt, ist es auch einfach zu erlernen. Sobald Sie mit dem Lernen beginnen, können Sie praktisch sofort mit dem Codieren beginnen.

# py.ad1h
source: Usability:
de_de: Benutzerfreundlichkeit:

# py.ad2
source: Even the biggest fans of Python would agree to certain design limitations in the language since it is written dynamically. This requires more testing and bugs to appear only during runtime. The language's global interpreter lock means that only one thread can access Python internals at a time.
de_de: Sogar die größten Fans von Python würden bestimmten Designeinschränkungen in der Sprache zustimmen, da es dynamisch geschrieben wird. Dies erfordert mehr Tests und Fehler, um nur während der Laufzeit aufzutauchen. Die globale Interpretersperre der Sprache bedeutet, dass immer nur ein Thread auf Python-Interna zugreifen kann.

# py.ad2h
source: Desing restrictions:
de_de: Desingeinschränkungen:

# py.ad3
source: The Python community provides users with fast and effective support. Hundreds of thousands of developers work hard to find and fix bugs and develop new patches and improvements for the language. This also provides quick feedback in many ways. For one, programmers can skip various tasks that would have to be performed in other languages.
de_de: Die Python-Community bietet Anwendern eine schnelle und effektive Unterstützung. Hunderttausende Entwickler arbeiten hart daran, Fehler zu finden und zu beheben und neue Patches und Verbesserungen für die Sprache zu entwickeln. Das bietet auch schnelles Feedback in vielerlei Hinsicht. Zum einen können Programmierer verschiedene Aufgaben überspringen, die in anderen Sprachen ausgeführt werden müssten.

# py.ad3h
source: Uncomplicated and fast:
de_de: Unkompliziert und schnell:

# py.ad4
source: Python is strong on desktop and server platforms, but weak on mobile platforms. There have been only a handful of smartphone apps developed with Python, and the language is rarely found on the client side of web development applications. The language is also absent from web development browsers. This is because there is still a lack of a good secure sandbox language for it.
de_de: Python ist auf Desktop- und Serverplattformen stark, auf mobilen Plattformen jedoch schwach. Es gab nur eine Handvoll Smartphone-Apps, die mit Python entwickelt wurden, und die Sprache ist auf der Clientseite von Webentwicklungsanwendungen selten zu finden. Die Sprache ist auch in Webentwicklungsbrowsern nicht vorhanden. Dies liegt daran, dass immer noch eine gute sichere Sandboxsprache dafür fehlt.

# py.ad4h
source: Lack of mobile computers and browsers:
de_de: Mangel an mobilen Computern und Browsern:

# py.c
source: Copy Code
de_de: Code kopieren

# py.p1
source: Python is a programming language that is easy to learn and very versatile thanks to its clear syntax and simple readability. Python is freely available for the common operating systems. The usual programming paradigms such as object-oriented or functional programming are supported.
de_de: Python ist eine Programmiersprache, die dank ihrer klaren Syntax und einfachen Lesbarkeit leicht zu erlernen ist und sich sehr vielseitig einsetzen lässt. Für die gängigen Betriebssysteme ist Python frei verfügbar. Die üblichen Programmierparadigmen wie die objektorientierte oder funktionale Programmierung werden unterstützt.

# py.p2
source: Python is a programming language with a clear syntax and good readability. It is considered easy to learn and is interpretable in the most common operating systems. Python supports several paradigms of programming such as functional, object-oriented or aspect-oriented programming and can also be used as a scripting language.
de_de: Bei Python handelt es sich um eine Programmiersprache mit einer klaren Syntax und guten Lesbarkeit. Sie gilt als leicht zu erlernen und ist in den gängigen Betriebssystemen interpretierbar. Python unterstützt mehrere Paradigmen der Programmierung wie die funktionale, objektorientierte oder aspektorientierte Programmierung und ist auch als Skriptsprache nutzbar.

# py.p3
source: In principle, no development environment is necessary for Python, since Python code does not need to be compiled and scripts can be written with any text editor. Interpreters are interactive and allow experimenting with the possibilities of the language. Common editors used by programmers such as Emacs or Vim are adaptable for Python.
de_de: Grundsätzlich ist für Python keine Entwicklungsumgebung notwendig, da Pythoncode nicht kompiliert werden muss und Skripte sich mit beliebigen Texteditoren schreiben lassen. Interpreter sind interaktiv und erlauben mit den Möglichkeiten der Sprache zu experimentieren. Gängige von Programmierern genutzte Editoren wie Emacs oder Vim sind für Python anpassbar.

# py.r
source: Run Code
de_de: Code ausführen
